Repository: jlbbooks/Teleferika
Catalog: lib/l10n/app_*.arb
Languages: it

# photo_manager_no_photos
source: No photos yet.
it: Nessuna foto ancora.

# photo_manager_gallery
source: Gallery
it: {platform, select, android{Galleria} ios{Foto} other{Galleria}}

# photo_manager_camera
source: Camera
it: Fotocamera

# photo_manager_add_photo_tooltip
source: Add Photo
it: Aggiungi foto

# photo_manager_photo_deleted
source: Photo deleted
it: Foto eliminata

# photo_manager_photo_changes_saved
source: Photo changes saved automatically.
it: Modifiche alle foto salvate automaticamente.

# photo_manager_error_saving_photo_changes
source: Error saving photo changes: {errorMessage}
it: Errore durante il salvataggio delle modifiche alle foto: {errorMessage}

# photo_manager_error_saving_image
source: Error saving image: {errorMessage}
it: Errore durante il salvataggio dell'immagine: {errorMessage}

# photo_manager_error_picking_image
source: Error picking image: {errorMessage}
it: Errore durante la selezione dell'immagine: {errorMessage}

# photo_manager_error_deleting_photo
source: Error deleting photo: {errorMessage}
it: Errore durante l'eliminazione della foto: {errorMessage}

# photo_manager_wait_saving
source: Please wait, photos are being saved...
it: Attendere, salvataggio foto in corso...

# app_version_label
source: App Version: {version}
it: Versione app: {version}

# licence_active_content
source: Licensed to: {email} Status: Active Valid Until: {validUntil}
it: Licenza a: {email} Stato: Attiva Valida fino a: {validUntil}

# licence_expired_content
source: Licensed to: {email} Status: Expired Valid Until: {validUntil} Please import a valid licence.
it: Licenza a: {email} Stato: Scaduta Valida fino a: {validUntil} Importa una licenza valida.

# licence_none_content
source: No active licence found. Please import a licence file to unlock premium features.
it: Nessuna licenza attiva trovata. Importa un file di licenza per sbloccare le funzionalità premium.

# licence_status
source: Licence Status: {status}
it: Stato licenza: {status}

# feature_demo_failed
source: Feature demonstration failed: {error}
it: Dimostrazione funzionalità fallita: {error}

# licence_imported_successfully
source: Licence for {email} imported successfully!
it: Licenza per {email} importata con successo!

# licence_import_cancelled
source: Licence import cancelled or failed.
it: Importazione licenza annullata o fallita.

source: Demo license imported successfully!
it: Licenza demo importata con successo!

source: License cleared successfully!
it: Licenza rimossa con successo!

# confirm_deletion_content
source: Are you sure you want to delete point {pointName}? This action cannot be undone.
it: Sei sicuro di voler eliminare il punto {pointName}? Questa azione non può essere annullata.

# point_deleted_success
source: Point {pointName} deleted successfully!
it: Punto {pointName} eliminato con successo!

# error_deleting_point
source: Error deleting point {pointName}: {errorMessage}
it: Errore durante l'eliminazione del punto {pointName}: {errorMessage}

# error_saving_point
source: Error saving point: {errorMessage}
it: Errore durante il salvataggio del punto: {errorMessage}

# selected_count
source: {count} selected
it: {count} selezionati

# delete_projects_content
source: Are you sure you want to delete {count} selected project(s)? This action cannot be undone.
it: Sei sicuro di voler eliminare {count} progetti selezionati? Questa azione non può essere annullata.

# project_label_prefix
source: Project:
it: Progetto:

# gpsPrecisionLabel
source: GPS Precision:
it: Precisione GPS:

# pointDetailsSectionTitle
source: Point Details
it: Dettagli Punto
