Repository: jlbbooks/Teleferika
Catalog: lib/l10n/app_*.arb
Languages: it

# loadingScreenMessage
source: Loading {appName}...
it: Caricamento {appName}...

# projectPageTitle
source: Project Details
it: Dettagli Progetto

# tabDetails
source: Details
it: Dettagli

# tabPoints
source: Points
it: Punti

# tabCompass
source: Compass
it: Bussola

# tabMap
source: Map
it: Mappa

# formFieldNameLabel
source: Project Name
it: Nome Progetto

# formFieldAzimuthLabel
source: Azimuth (°)
it: Azimut (°)

# formFieldProjectDateLabel
source: Project Date
it: Data Progetto

# formFieldLastUpdatedLabel
source: Last Updated
it: Ultimo Aggiornamento

# formFieldPresumedTotalLengthLabel
source: Presumed Total Length (m)
it: Lunghezza totale presunta (m)

# buttonSave
source: Save
it: Salva

# buttonCalculateAzimuth
source: Calculate Azimuth
it: Calcola Azimut

# buttonCalculate
source: Calculate
it: Calcola

# buttonSelectDate
source: Select Date
it: Seleziona Data

# compassAddPointButton
source: Add Point
it: Aggiungi Punto

# compassAddAsEndPointButton
source: Add as End Point
it: Aggiungi come Fine

# pointsSetAsStartButton
source: Set as Start
it: Imposta come Inizio

# pointsSetAsEndButton
source: Set as End
it: Imposta come Fine

# pointsDeleteButton
source: Delete
it: Elimina

# errorSaveProjectBeforeAddingPoints
source: Please save the project before adding points.
it: Salvare il progetto prima di aggiungere punti.

# infoFetchingLocation
source: Fetching location...
it: Recupero posizione...

# pointAddedSnackbar
source: Point P{ordinalNumber} added.
it: Punto P{ordinalNumber} aggiunto.

# pointAddedSetAsEndSnackbarSuffix
source: Set as END point.
it: Impostato come punto FINALE.

# pointAddedInsertedBeforeEndSnackbarSuffix
source: Inserted before current end point.
it: Inserito prima del punto finale corrente.

# pointFromCompassDefaultNote
source: Added (H: {altitude}°)
it: Punto da Bussola (A: {altitude}°)

# errorAddingPoint
source: Error adding point: {errorMessage}
it: Errore durante l'aggiunta del punto: {errorMessage}

# errorLoadingProjectDetails
source: Error loading project details: {errorMessage}
it: Errore durante il caricamento dei dettagli del progetto: {errorMessage}

# errorAzimuthPointsNotSet
source: Starting and/or ending point not set. Cannot calculate azimuth.
it: Punto iniziale e/o finale non impostato. Impossibile calcolare l'azimut.

# errorAzimuthPointsSame
source: Starting and ending points are the same. Azimuth is undefined or 0.
it: I punti iniziale e finale sono uguali. L'azimut è indefinito o 0.

# errorAzimuthCouldNotRetrievePoints
source: Could not retrieve point data for calculation. Please check points.
it: Impossibile recuperare i dati dei punti per il calcolo. Controllare i punti.

# errorCalculatingAzimuth
source: Error calculating azimuth: {errorMessage}
it: Errore durante il calcolo dell'azimut: {errorMessage}

# azimuthCalculatedSnackbar
source: Azimuth calculated: {azimuthValue}°
it: Azimut calcolato: {azimuthValue}°

# azimuthSavedSnackbar
source: Azimuth saved successfully.
it: Azimut salvato con successo.

# azimuthOverwriteTitle
source: Overwrite Azimuth?
it: Sovrascrivere l'azimut?

# azimuthOverwriteMessage
source: The azimuth field already has a value. The new calculated value will overwrite the current value. Do you want to continue?
it: Il campo azimut ha già un valore. Il nuovo valore calcolato sovrascriverà quello attuale. Vuoi continuare?

# projectNameCannotBeEmptyValidator
source: Project name cannot be empty.
it: Il nome del progetto non può essere vuoto.

source: Project saved successfully.
it: Progetto salvato con successo.

# dialogTitleConfirmDelete
source: Confirm Delete
it: Conferma Eliminazione

# dialogContentConfirmDeletePoint
source: Are you sure you want to delete point P{pointOrdinal}? This action cannot be undone.
it: Sei sicuro di voler eliminare il punto P{pointOrdinal}? Questa azione non può essere annullata.

# buttonCancel
source: Cancel
it: Annulla

# buttonDelete
source: Delete
it: Elimina

# pointDeletedSnackbar
source: Point P{pointOrdinal} deleted.
it: Punto P{pointOrdinal} eliminato.

# pointSetAsStartSnackbar
source: Point P{pointOrdinal} set as start.
it: Punto P{pointOrdinal} impostato come inizio.

# pointSetAsEndSnackbar
source: Point P{pointOrdinal} set as end.
it: Punto P{pointOrdinal} impostato come fine.

# export_project_data_title
source: Export Project Data
it: Esporta dati progetto

# export_page_project_name_label
source: Project: {projectName}
it: Progetto: {projectName}

# export_page_points_count_label
source: {count,plural, =0{No points found for export.} =1{{count} point found.} other{{count} points found.}}
it: {count,plural, =0{Nessun punto trovato per l'esportazione.} =1{{count} punto trovato.} other{{count} punti trovati.}}

# export_page_select_format_label
source: Select Export Format:
it: Seleziona formato di esportazione:

# export_format_dropdown_label
source: Format
it: Formato

# export_page_share_button
source: Share File
it: Condividi file

# export_page_save_locally_button
source: Save Locally
it: Salva localmente

# export_failed
source: Export failed. Please try again.
it: Esportazione fallita. Riprova.

# file_shared_successfully
source: File prepared for sharing.
it: File pronto per la condivisione.

source: File saved successfully
it: File salvato con successo

# file_save_cancelled_or_failed
source: File save was cancelled or failed.
it: Salvataggio file annullato o fallito.

# export_project_data_tooltip
source: Export Project Data
it: Esporta dati progetto

# export_project_tooltip
source: Export Project
it: Esporta progetto

# errorExportNoPoints
source: No points to export
it: Nessun punto da esportare

# infoExporting
source: Exporting...
it: Esportazione in corso...

# exportSuccess
source: Project exported successfully
it: Progetto esportato con successo

# exportError
source: Export failed
it: Esportazione fallita

# exportErrorWithDetails
source: Export error: {errorMessage}
it: Errore di esportazione: {errorMessage}

# exportRequiresValidLicence
source: Valid licence required for export
it: Licenza valida richiesta per l'esportazione

# mapDownloadRequiresValidLicence
source: Valid licence required for map download
it: Licenza valida richiesta per il download delle mappe

# unsaved_changes_title
source: Unsaved Changes
it: Modifiche non salvate

# unsaved_changes_export_message
source: You have unsaved changes. Please save the project before exporting to ensure all data is included.
it: Hai modifiche non salvate. Salva il progetto prima di esportare per assicurarti che tutti i dati siano inclusi.

# save_button_label
source: Save
it: Salva

# dialog_cancel
source: Cancel
it: Annulla

# project_not_loaded_cannot_export
source: Project not loaded. Cannot export data.
it: Progetto non caricato. Impossibile esportare i dati.

# error_loading_points
source: Error loading points for export. Please try again.
it: Errore durante il caricamento dei punti per l'esportazione. Riprova.

# export_page_note_text
source: Note: Ensure you have granted necessary storage permissions if saving locally on mobile devices. Some export formats may not include all data types (e.g., images).
it: Nota: assicurati di aver concesso le autorizzazioni di archiviazione necessarie se salvi localmente su dispositivi mobili. Alcuni formati di esportazione potrebbero non includere tutti i tipi di dati (es. immagini).

# please_save_project_first_to_export
source: Please save the new project first to enable export.
it: Salva prima il nuovo progetto per abilitare l'esportazione.

# export_requires_licence_title
source: Licence Required for Export
it: Licenza richiesta per l'esportazione

# export_requires_licence_message
source: This feature requires an active licence. Please import a valid licence file to proceed.
it: Questa funzione richiede una licenza attiva. Importa un file di licenza valido per procedere.

# action_import_licence
source: Import Licence
it: Importa licenza

# unsaved_changes_dialog_title
source: Unsaved Changes
it: Modifiche non salvate

# unsaved_changes_dialog_content
source: You have unsaved changes. Do you want to discard them and leave?
it: Hai modifiche non salvate. Vuoi scartarle e uscire?

# discard_button_label
source: Discard
it: Scarta

# details_tab_label
source: Details
it: Dettagli

# points_tab_label
source: Points
it: Punti

# compass_tab_label
source: Compass
it: Bussola

# map_tab_label
source: Map
it: Mappa

# unsaved_changes_discard_message
source: You have unsaved changes. Discard them and leave?
it: Hai modifiche non salvate. Scartarle e uscire?

# unsaved_changes_discard_button
source: Discard Changes
it: Scarta modifiche

# unsaved_changes_save_button
source: Save Changes
it: Salva modifiche

# export_page_no_points
source: No points available for export.
it: Nessun punto disponibile per l'esportazione.

# edit_project_title
source: Edit Project
it: Modifica progetto

# edit_project_title_named
source: Edit: {projectName}
it: Modifica progetto: {projectName}

# new_project_title
source: New Project
it: Nuovo progetto

# delete_project_tooltip
source: Delete Project
it: Elimina progetto

# save_project_tooltip
source: Save Project
it: Salva progetto

# last_updated_label
source: Updated: {date}
it: Aggiornato: {date}

source: No updates
it: Nessun aggiornamento

# not_yet_saved_label
source: Not yet saved
it: Non ancora salvato

source: Tap to set date
it: Tocca per impostare la data

# invalid_number_validator
source: Invalid number.
it: Inserisci un numero valido.

# must_be_359_validator
source: Must be +/-359.99
it: Il valore deve essere compreso tra 0 e 359.

# please_correct_form_errors
source: Please correct the errors in the form.
it: Correggi gli errori nel modulo.

source: Project created successfully!
it: Progetto creato con successo.

# project_already_up_to_date
source: Project already up to date or not found.
it: Il progetto è già aggiornato.

# cannot_delete_unsaved_project
source: Cannot delete a project that has not been saved yet.
it: Impossibile eliminare un progetto non salvato.

# confirm_delete_project_title
source: Confirm Delete
it: Conferma eliminazione progetto

# confirm_delete_project_content
source: Are you sure you want to delete the project "{projectName}"? This action cannot be undone.
it: Sei sicuro di voler eliminare questo progetto? Questa azione non può essere annullata.

source: Project deleted successfully.
it: Progetto eliminato con successo.

# project_not_found_or_deleted
source: Project not found or already deleted.
it: Progetto non trovato o già eliminato.

# error_saving_project
source: Error saving project: {errorMessage}
it: Errore durante il salvataggio del progetto: {errorMessage}

# error_deleting_project
source: Error deleting project: {errorMessage}
it: Errore durante l'eliminazione del progetto: {errorMessage}

# export_page_title
source: Export Project Data
it: Esporta progetto

# export_page_description
source: Export your project data in various formats.
it: Scegli il formato e le opzioni per esportare i dati del progetto.

# export_format_csv
source: CSV (Comma-Separated Values)
it: CSV (valori separati da virgola)

# export_format_kml
source: KML (Keyhole Markup Language)
it: KML (Google Earth)

# mapErrorLoadingPoints
source: Error loading points for map: {errorMessage}
it: Errore durante il caricamento dei punti sulla mappa: {errorMessage}

# mapPointMovedSuccessfully
source: Point P{ordinalNumber} moved successfully!
it: Punto P{ordinalNumber} spostato con successo!

# mapErrorMovingPoint
source: Error: Could not move point P{ordinalNumber}. Point not found or not updated.
it: Errore: Impossibile spostare il punto P{ordinalNumber}. Punto non trovato o non aggiornato.

# mapErrorMovingPointGeneric
source: Error moving point P{ordinalNumber}: {errorMessage}
it: Errore durante lo spostamento del punto P{ordinalNumber}: {errorMessage}

# mapTooltipMovePoint
source: Move Point
it: Sposta Punto

# mapTooltipSaveChanges
source: Save Changes
it: Salva Modifiche

# mapTooltipCancelMove
source: Cancel Move
it: Annulla Spostamento

# mapTooltipEditPointDetails
source: Edit Details
it: Modifica Dettagli

# mapTooltipAddPointFromCompass
source: Add Point at Current Location (from Compass)
it: Aggiungi Punto alla Posizione Corrente (da Bussola)

# mapNoPointsToDisplay
source: No points to display on the map.
it: Nessun punto da visualizzare sulla mappa.

# mapLocationPermissionDenied
source: Location permission denied. Map features requiring location will be limited.
it: Permesso di localizzazione negato. Le funzionalità della mappa che richiedono la posizione saranno limitate.

# mapSensorPermissionDenied
source: Sensor (compass) permission denied. Device orientation features will be unavailable.
it: Permesso sensore (bussola) negato. Le funzionalità di orientamento del dispositivo non saranno disponibili.

# mapErrorGettingLocationUpdates
source: Error getting location updates: {errorMessage}
it: Errore durante l'ottenimento degli aggiornamenti sulla posizione: {errorMessage}

# mapErrorGettingCompassUpdates
source: Error getting compass updates: {errorMessage}
it: Errore durante l'ottenimento degli aggiornamenti della bussola: {errorMessage}

# mapLoadingPointsIndicator
source: Loading points...
it: Caricamento punti...

# mapPermissionsRequiredTitle
source: Permissions Required
it: Permessi Richiesti

# mapLocationPermissionInfoText
source: Location permission is needed to show your current position and for some map features.
it: Il permesso di localizzazione è necessario per mostrare la tua posizione attuale e per alcune funzionalità della mappa.

# mapSensorPermissionInfoText
source: Sensor (compass) permission is needed for direction-based features.
it: Il permesso del sensore (bussola) è necessario per le funzionalità basate sulla direzione.

# mapButtonOpenAppSettings
source: Open App Settings
it: Apri Impostazioni App

# mapButtonRetryPermissions
source: Retry Permissions
it: Riprova Permessi

# mapDeletePointDialogTitle
source: Confirm Deletion
it: Conferma Eliminazione

# mapDeletePointDialogContent
source: Are you sure you want to delete point P{pointOrdinalNumber}?
it: Sei sicuro di voler eliminare il punto P{pointOrdinalNumber}?

# mapDeletePointDialogCancelButton
source: Cancel
it: Annulla

# mapDeletePointDialogDeleteButton
source: Delete
it: Elimina

# mapPointDeletedSuccessSnackbar
source: Point P{pointOrdinalNumber} deleted.
it: Punto P{pointOrdinalNumber} eliminato.

# mapErrorPointNotFoundOrDeletedSnackbar
source: Error: Point P{pointOrdinalNumber} could not be found or deleted from map view.
it: Errore: Impossibile trovare o eliminare il punto P{pointOrdinalNumber} dalla vista mappa.

# mapErrorDeletingPointSnackbar
source: Error deleting point P{pointOrdinalNumber}: {errorMessage}
it: Errore durante l'eliminazione del punto P{pointOrdinalNumber}: {errorMessage}

# compassHeadingNotAvailable
source: Cannot add point: Compass heading not available.
it: Impossibile aggiungere punto: direzione bussola non disponibile.

# projectAzimuthLabel
source: Project Azimuth: {azimuth}°
it: Azimut Progetto: {azimuth}°

# projectAzimuthRequiresPoints
source: Project Azimuth: (Requires at least 2 points)
it: Azimut Progetto: (Richiede almeno 2 punti)

# projectAzimuthNotCalculated
source: Project Azimuth: Not yet calculated
it: Azimut Progetto: Non ancora calcolato

# compassAccuracyHigh
source: High Accuracy
it: Alta Precisione

# compassAccuracyMedium
source: Medium Accuracy
it: Precisione Media

# compassAccuracyLow
source: Low Accuracy
it: Bassa Precisione

# compassPermissionsRequired
source: Permissions Required
it: Permessi Richiesti

# compassPermissionsMessage
source: This tool requires sensor and location permissions to function correctly. Please grant them in your device settings.
it: Questo strumento richiede i permessi di sensore e localizzazione per funzionare correttamente. Concedili nelle impostazioni del dispositivo.

# openSettingsButton
source: Open Settings
it: Apri Impostazioni

# retryButton
source: Retry
it: Riprova

# mapAcquiringLocation
source: Acquiring location...
it: Acquisizione posizione...

# mapCenterOnLocation
source: Center on my location
it: Centra sulla mia posizione

# mapAddNewPoint
source: Add New Point
it: Aggiungi Nuovo Punto

# mapCenterOnPoints
source: Center on points
it: Centra sui punti

# mapTypeSelector
source: Map Type
it: Tipo Mappa

# must_be_positive_validator
source: Must be positive.
it: Deve essere positivo.

# mapNewPointLabel
source: NEW
it: NUOVO

# mapSaveNewPoint
source: Save
it: Salva

# mapDiscardNewPoint
source: Discard
it: Scarta

# mapNewPointSaved
source: New point saved successfully!
it: Nuovo punto salvato con successo!

# mapErrorSavingNewPoint
source: Error saving new point: {errorMessage}
it: Errore durante il salvataggio del nuovo punto: {errorMessage}

# mapUnsavedPointExists
source: You have an unsaved point. Please save or discard it before adding another.
it: Hai un punto non salvato. Salvalo o scartalo prima di aggiungerne un altro.

# mapCompassDirectionTooltip
source: Compass Direction
it: Direzione Bussola

# mapCompassNorthIndicator
source: North
it: Nord

# errorLocationUnavailable
source: Location unavailable.
it: Posizione non disponibile.

# infoPointAddedPendingSave
source: Point added (pending save)
it: Punto aggiunto (in attesa di salvataggio)

# errorGeneric
source: Error
it: Errore

# edit_point_title
source: Edit Point
it: Modifica Punto

# coordinates_section_title
source: Coordinates
it: Coordinate

# latitude_label
source: Latitude
it: Latitudine

# latitude_hint
source: e.g. 45.12345
it: es. 45.12345

# latitude_empty_validator
source: Latitude cannot be empty
it: La latitudine non può essere vuota

# latitude_invalid_validator
source: Invalid number format
it: Formato numero non valido

# latitude_range_validator
source: Latitude must be between -90 and 90
it: La latitudine deve essere tra -90 e 90

# longitude_label
source: Longitude
it: Longitudine

# longitude_hint
source: e.g. -12.54321
it: es. -12.54321

# longitude_empty_validator
source: Longitude cannot be empty
it: La longitudine non può essere vuota

# longitude_invalid_validator
source: Invalid number format
it: Formato numero non valido

# longitude_range_validator
source: Longitude must be between -180 and 180
it: La longitudine deve essere tra -180 e 180

# additional_data_section_title
source: Additional Data
it: Dati aggiuntivi

# altitude_label
source: Altitude (m)
it: Altitudine (m)

# altitude_hint
source: e.g. 1203.5 (Optional)
it: es. 1203.5 (Opzionale)

# altitude_invalid_validator
source: Invalid number format
it: Formato numero non valido

# altitude_range_validator
source: Altitude must be between -1000 and 8849 meters
it: L'altitudine deve essere tra -1000 e 8849 metri

# note_label
source: Note (Optional)
it: Note (Opzionale)

# note_hint
source: Any observations or details...
it: Osservazioni o dettagli...

# photos_section_title
source: Photos
it: Foto

# unsaved_point_details_title
source: Unsaved Changes
it: Modifiche non salvate

# unsaved_point_details_content
source: You have unsaved changes to point details. Save them?
it: Hai modifiche non salvate ai dettagli del punto. Vuoi salvarle?

source: Discard Text Changes
it: Scarta modifiche testo

# save_all_and_exit
source: Save All & Exit
it: Salva tutto ed esci

# confirm_deletion_title
source: Confirm Deletion
it: Conferma eliminazione

source: Point details saved!
it: Dettagli punto salvati!

# undo_changes_tooltip
source: Undo Changes
it: Annulla modifiche

# no_projects_yet
source: No projects yet. Tap '+' to add one!
it: Nessun progetto ancora. Tocca '+' per aggiungerne uno!

# add_new_project_tooltip
source: Add New Project
it: Aggiungi nuovo progetto

source: Untitled Project
it: Progetto senza titolo

source: Delete Selected
it: Elimina selezionati

# delete_projects_title
source: Delete Project(s)?
it: Eliminare progetti?

# license_information_title
source: Licence Information
it: Informazioni licenza

# close_button
source: Close
it: Chiudi

source: Import New Licence
it: Importa nuova licenza

source: Import Licence
it: Importa licenza

# premium_features_title
source: Premium Features
it: Funzionalità Premium

# premium_features_available
source: Premium features are available in this build!
it: Le funzionalità premium sono disponibili in questa versione!

source: Available Features:
it: Funzionalità disponibili:

# premium_features_not_available
source: Premium features are not available in this build.
it: Le funzionalità premium non sono disponibili in questa versione.

# opensource_version
source: This is the opensource version of the app.
it: Questa è la versione open source dell'app.

source: Try Feature
it: Prova funzionalità

source: Install Demo License
it: Installa licenza demo

source: Clear License
it: Cancella licenza

source: Invalid latitude or longitude format.
it: Formato latitudine o longitudine non valido.

# invalid_altitude_format
source: Invalid altitude format. Please enter a number or leave it empty.
it: Formato altitudine non valido. Inserisci un numero o lascia vuoto.

source: Coordinates
it: Coordinate

source: Add a note...
it: Aggiungi una nota...

source: Tap to add note...
it: Tocca per aggiungere una nota...

source: Save
it: Salva

source: Discard
it: Scarta

source: Edit
it: Modifica

source: Move
it: Sposta

source: Cancel
it: Annulla

source: Delete
it: Elimina

source: Tap on the map to set new location
it: Tocca sulla mappa per impostare la nuova posizione

# locationPermissionTitle
source: Location Permission
it: Permesso di localizzazione

# sensorPermissionTitle
source: Sensor Permission
it: Permesso sensore

source: No note
it: Nessuna nota

# distanceFromPrevious
source: Distance from {pointName}:
it: Distanza da {pointName}:

# offsetLabel
source: Offset:
it: Scostamento:

# angleLabel
source: Angle:
it: Angolo:

# delete_photo_title
source: Delete Photo?
it: Eliminare foto?

# delete_photo_content
source: Are you sure you want to delete {photoNumber} photo(s)?
it: Sei sicuro di voler eliminare {photoNumber} foto?

# camera_permission_title
source: Camera Permission
it: Permesso fotocamera

# camera_permission_description
source: Camera permission is needed to take photos.
it: Il permesso fotocamera è necessario per scattare foto.

# microphone_permission_title
source: Microphone Permission
it: Permesso microfono

# microphone_permission_description
source: Microphone permission is needed to record audio.
it: Il permesso microfono è necessario per registrare audio.

# storage_permission_title
source: Storage Permission
it: Permesso archiviazione

# storage_permission_description
source: Storage permission is needed to save files.
it: Il permesso archiviazione è necessario per salvare file.

# current_rope_length_label
source: Current Rope Length
it: Lunghezza attuale della fune

# point_deleted_pending_save
source: Point {pointName} deleted (pending save).
it: Punto {pointName} eliminato (in attesa di salvataggio).

# error_deleting_point_generic
source: Error deleting point {pointName}: {errorMessage}
it: Errore durante l'eliminazione del punto {pointName}: {errorMessage}

# compass_calibration_notice
source: Compass sensor needs calibration. Please move your device in a figure-8 motion.
it: Il sensore bussola necessita di calibrazione. Muovi il dispositivo a forma di 8.

# project_statistics_title
source: Project Statistics
it: Statistiche Progetto

# project_statistics_points
source: Points
it: Punti

# project_statistics_images
source: Images
it: Immagini

# project_statistics_current_length
source: Current Length
it: Lunghezza Attuale

# project_statistics_measurements
source: Measurements
it: Misurazioni

# points_list_title
source: Points List
it: Elenco Punti

# photo_manager_title
source: Photos
it: Foto
